# Cleaning the HousingValue and Rental datasets from (https://www.zillow.com/research/data/)

In [359]:
import pandas as pd
import numpy as np

### Adding datasets to dataframes

In [360]:
df_rentals = pd.read_csv('Rentals.csv')
df_homeValues = pd.read_csv('HomeValues.csv')
dataframes = [df_rentals, df_homeValues]

In [361]:
df_homeValues.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,State,City,Metro,CountyName,2000-01-31,...,2023-07-31,2023-08-31,2023-09-30,2023-10-31,2023-11-30,2023-12-31,2024-01-31,2024-02-29,2024-03-31,2024-04-30
0,91982,1,77494,zip,TX,TX,Katy,"Houston-The Woodlands-Sugar Land, TX",Fort Bend County,213463.221766,...,488235.174762,490749.946441,492598.348830,493857.713761,494559.104796,495182.966394,496580.196689,498775.863988,501631.311127,504191.521560
1,61148,2,8701,zip,NJ,NJ,Lakewood,"New York-Newark-Jersey City, NY-NJ-PA",Ocean County,137293.774710,...,552105.838958,557998.314944,564321.215281,571660.009863,578460.106425,583227.579651,584811.159583,587368.424745,592465.126119,600765.893612
2,91940,3,77449,zip,TX,TX,Katy,"Houston-The Woodlands-Sugar Land, TX",Harris County,104657.662381,...,280286.283611,281194.368840,281734.942252,281724.603121,281486.774213,281192.083503,281550.767554,282258.587207,283366.392394,284335.695860
3,62080,4,11368,zip,NY,NY,New York,"New York-Newark-Jersey City, NY-NJ-PA",Queens County,151159.744038,...,470293.119764,470287.047021,469717.985426,467648.873528,464224.467531,459848.455550,456960.515649,455322.918370,458447.265050,463052.465021
4,91733,5,77084,zip,TX,TX,Houston,"Houston-The Woodlands-Sugar Land, TX",Harris County,103553.438861,...,274946.698136,275833.130611,276267.718851,276257.923524,275831.123272,275402.735803,275449.324127,275980.979306,276993.281910,277995.947760

In [362]:
df_rentals.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,State,City,Metro,CountyName,2015-01-31,...,2023-07-31,2023-08-31,2023-09-30,2023-10-31,2023-11-30,2023-12-31,2024-01-31,2024-02-29,2024-03-31,2024-04-30
0,91982,1,77494,zip,TX,TX,Katy,"Houston-The Woodlands-Sugar Land, TX",Fort Bend County,1555.536799,...,1934.844177,1941.327788,1948.778725,1957.250001,1960.066902,1963.351201,1958.278876,1968.720406,1974.775402,1997.871160
1,91940,3,77449,zip,TX,TX,Katy,"Houston-The Woodlands-Sugar Land, TX",Harris County,1284.029481,...,1806.015681,1794.944195,1800.444825,1806.571861,1820.391306,1826.888729,1844.605739,1848.969319,1851.221071,1855.652381
2,62080,4,11368,zip,NY,NY,New York,"New York-Newark-Jersey City, NY-NJ-PA",Queens County,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2200.000000
3,91733,5,77084,zip,TX,TX,Houston,"Houston-The Woodlands-Sugar Land, TX",Harris County,NaN,...,1738.168997,1747.816089,1749.620035,1773.816143,1777.586181,1790.317844,1789.793785,1794.866847,1794.670427,1800.256223
4,93144,6,79936,zip,TX,TX,El Paso,"El Paso, TX",El Paso County,NaN,...,1409.301198,1412.328423,1411.361263,1419.035194,1422.825104,1437.591357,1436.376828,1436.279997,1437.440684,1448.527778

### Checking datatypes and columns

In [363]:
#show counts of each column
df_rentals.dtypes

RegionID        int64
SizeRank        int64
RegionName      int64
RegionType     object
StateName      object
               ...
2023-12-31    float64
2024-01-31    float64
2024-02-29    float64
2024-03-31    float64
2024-04-30    float64
Length: 121, dtype: object

In [364]:
df_homeValues.dtypes

RegionID        int64
SizeRank        int64
RegionName      int64
RegionType     object
StateName      object
               ...
2023-12-31    float64
2024-01-31    float64
2024-02-29    float64
2024-03-31    float64
2024-04-30    float64
Length: 301, dtype: object

In [365]:
print(df_rentals.columns)
print(df_homeValues.columns)

Index(['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName',
       'State', 'City', 'Metro', 'CountyName', '2015-01-31',
       ...
       '2023-07-31', '2023-08-31', '2023-09-30', '2023-10-31', '2023-11-30',
       '2023-12-31', '2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30'],
      dtype='object', length=121)
Index(['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName',
       'State', 'City', 'Metro', 'CountyName', '2000-01-31',
       ...
       '2023-07-31', '2023-08-31', '2023-09-30', '2023-10-31', '2023-11-30',
       '2023-12-31', '2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30'],
      dtype='object', length=301)

### Changing descriptive columns to type category

In [366]:
#change ['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName','State', 'City', 'Metro', 'CountyName'] to category
for df in dataframes:
    df['RegionID'] = df['RegionID'].astype('category')
    df['SizeRank'] = df['SizeRank'].astype('category')
    df['RegionName'] = df['RegionName'].astype('category')
    df['RegionType'] = df['RegionType'].astype('category')
    df['StateName'] = df['StateName'].astype('category')
    df['State'] = df['State'].astype('category')
    df['City'] = df['City'].astype('category')
    df['Metro'] = df['Metro'].astype('category')
    df['CountyName'] = df['CountyName'].astype('category')

for df in dataframes:
    print(df.dtypes)

RegionID      category
SizeRank      category
RegionName    category
RegionType    category
StateName     category
                ...
2023-12-31     float64
2024-01-31     float64
2024-02-29     float64
2024-03-31     float64
2024-04-30     float64
Length: 121, dtype: object
RegionID      category
SizeRank      category
RegionName    category
RegionType    category
StateName     category
                ...
2023-12-31     float64
2024-01-31     float64
2024-02-29     float64
2024-03-31     float64
2024-04-30     float64
Length: 301, dtype: object

### Removing all rows that aren't based in New York or New Jersey

In [367]:
# Count the rows in df_rentals
num_rows_rentals = df_rentals.shape[0]
print(f"Number of rows in df_rentals: {num_rows_rentals}")

# Count the rows in df_homeValues
num_rows_homeValues = df_homeValues.shape[0]
print(f"Number of rows in df_homeValues: {num_rows_homeValues}")

#remove rows without state = NY or NJ
df_rentals = df_rentals[df_rentals['State'].isin(['NY', 'NJ'])]
df_homeValues = df_homeValues[df_homeValues['State'].isin(['NY', 'NJ'])]
print ("Rows removed.")

# Count the rows in df_rentals
num_rows_rentals = df_rentals.shape[0]
print(f"Number of rows in df_rentals: {num_rows_rentals}")

# Count the rows in df_homeValues
num_rows_homeValues = df_homeValues.shape[0]
print(f"Number of rows in df_homeValues: {num_rows_homeValues}")

Number of rows in df_rentals: 7115
Number of rows in df_homeValues: 26348
Rows removed.
Number of rows in df_rentals: 511
Number of rows in df_homeValues: 2108

### Checking for duplicate rows or columns

In [368]:
for df in dataframes:

    #Print the number of duplicates, without the original rows that were duplicated
    print('Number of duplicate (excluding first) rows in the table is: ', df.duplicated().sum())

    # Check for duplicate rows. 
    # Use "keep=False" to mark all duplicates as true, including the original rows that were duplicated.
    print('Number of duplicate rows (including first) in the table is:', df[df.duplicated(keep=False)].shape[0])

    # Check for duplicate columns
    #First transpose the df so columns become rows, then apply the same check as above
    dfT = df.T
    print("Number of duplicate (excluding first) columns in the table is: ", dfT.duplicated().sum())
    print("Number of duplicate (including first) columns in the table is: ",  dfT[dfT.duplicated(keep=False)].shape[0])

Number of duplicate (excluding first) rows in the table is:  0
Number of duplicate rows (including first) in the table is: 0
Number of duplicate (excluding first) columns in the table is:  1
Number of duplicate (including first) columns in the table is:  2
Number of duplicate (excluding first) rows in the table is:  0
Number of duplicate rows (including first) in the table is: 0
Number of duplicate (excluding first) columns in the table is:  1
Number of duplicate (including first) columns in the table is:  2

### Identifying and removing duplicate columns

In [369]:
#if there are 2 duplicate columns, identify them
dfT = df_rentals.T
print("Duplicate columns are: ", dfT[dfT.duplicated(keep=False)].index)

Duplicate columns are:  Index(['StateName', 'State'], dtype='object')

## Remove rows

In [370]:
#remove the every category column except for RegionName
df_rentals = df_rentals.drop(['RegionID', 'SizeRank', 'RegionType', 'StateName', 'State', 'City', 'Metro', 'CountyName'], axis=1)
df_homeValues = df_homeValues.drop(['RegionID', 'SizeRank', 'RegionType', 'StateName', 'State', 'City', 'Metro', 'CountyName'], axis=1)

print("Columns removed.")

Columns removed.

# Adding New york zip code information

In [371]:
df_zip_codes = pd.read_csv('nyc-zip-codes.csv')
df_zip_codes.head()

  Borough            Neighborhood  ZipCode
0   Bronx           Central Bronx    10453
1   Bronx           Central Bronx    10457
2   Bronx           Central Bronx    10460
3   Bronx  Bronx Park and Fordham    10458
4   Bronx  Bronx Park and Fordham    10467

In [372]:
#count rows in df_zip_codes
num_rows_zip_codes = df_zip_codes.shape[0]
print(f"Number of rows in df_zip_codes: {num_rows_zip_codes}")

Number of rows in df_zip_codes: 178

### Removing any data that doesn't have a zipcode within New york city

In [373]:
#Only keep rows that have a zip code in the df_zip_codes dataframe
#count the rows in df_rentals
num_rows_rentals = df_rentals.shape[0]
print(f"Number of rows in df_rentals: {num_rows_rentals}")

#count the rows in df_homeValues
num_rows_homeValues = df_homeValues.shape[0]
print(f"Number of rows in df_homeValues: {num_rows_homeValues}") 

df_rentals = df_rentals[df_rentals['RegionName'].isin(df_zip_codes['ZipCode'])]
df_homeValues = df_homeValues[df_homeValues['RegionName'].isin(df_zip_codes['ZipCode'])]

Number of rows in df_rentals: 511
Number of rows in df_homeValues: 2108

### Removing columns before 2018

In [374]:
#remove column if the regionname is before 2018-01
df_rentals = df_rentals.drop(df_rentals.columns[1:df_rentals.columns.get_loc('2018-01-31')], axis=1)

df_homeValues = df_homeValues.drop(df_homeValues.columns[1:df_homeValues.columns.get_loc('2018-01-31')], axis=1)

print("Columns removed.")

df_rentals.head()

Columns removed.

,RegionName,2018-01-31,2018-02-28,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,2018-08-31,2018-09-30,...,2023-07-31,2023-08-31,2023-09-30,2023-10-31,2023-11-30,2023-12-31,2024-01-31,2024-02-29,2024-03-31,2024-04-30
2,11368,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2200.000000
5,11385,2326.050511,2297.126722,2307.916520,2312.323474,2338.740709,2323.409658,2323.637606,2321.374938,2329.475916,...,2904.439104,2905.198054,2915.447936,2919.059660,2940.818440,2963.825136,2996.489860,3020.067111,3053.139273,3058.845842
7,11208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,2604.968839,2592.066513,2616.362749,2630.507800,2693.001037,2698.199488,2721.220653,2727.986231,2785.821331,2752.694444
14,11236,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,2553.409960,2634.676661,2654.310929,2713.608709,2721.708833,2819.462296,2925.528978,2970.704688,2951.833333
15,10467,1274.181284,1289.016187,1303.195413,1357.904525,1348.784335,1354.926101,1347.079955,1373.191788,1381.515955,...,1783.452469,1808.274423,1861.706482,1905.551507,1962.385436,1959.559624,1982.547741,1969.624655,2008.254253,2077.934524

## Melting the data

In [375]:
df_rentals_long = df_rentals.melt(id_vars=['RegionName'], var_name='Date', value_name='RentalValue')

# Transform df_homeValues from wide to long format
df_homeValues_long = df_homeValues.melt(id_vars=['RegionName'], var_name='Date', value_name='HomeValue')

# Display the transformed DataFrames to verify
print("Transformed df_rentals:")
print(df_rentals_long.head())

print("\nTransformed df_homeValues:")
print(df_homeValues_long.head())

Transformed df_rentals:
  RegionName        Date  RentalValue
0      11368  2018-01-31          NaN
1      11385  2018-01-31  2326.050511
2      11208  2018-01-31          NaN
3      11236  2018-01-31          NaN
4      10467  2018-01-31  1274.181284

Transformed df_homeValues:
  RegionName        Date      HomeValue
0      11368  2018-01-31  475623.750409
1      11385  2018-01-31  689332.524200
2      11208  2018-01-31  476537.559613
3      11236  2018-01-31  471722.143605
4      10467  2018-01-31  407100.997435

In [376]:
df_rentals_long.dtypes

RegionName     category
Date             object
RentalValue     float64
dtype: object

### Changing the Date column to type datatime

In [377]:
#Change the Date column to datetime
df_rentals_long['Date'] = pd.to_datetime(df_rentals_long['Date'])
df_homeValues_long['Date'] = pd.to_datetime(df_homeValues_long['Date'])

print(df_rentals_long.dtypes)
print(df_homeValues_long.dtypes)

RegionName           category
Date           datetime64[ns]
RentalValue           float64
dtype: object
RegionName          category
Date          datetime64[ns]
HomeValue            float64
dtype: object

### Merge the two dataframes

In [378]:

df_merged = pd.merge(df_homeValues_long, df_rentals_long, on=['RegionName', 'Date'], how='left')
# Display the number of rows in the merged dataframe to verify
print(f"Number of rows in df_homeValues: {df_homeValues_long.shape[0]}")
print(f"Number of rows in df_rentals: {df_rentals_long.shape[0]}")
print(f"Number of rows in df_merged: {df_merged.shape[0]}")

Number of rows in df_homeValues: 12844
Number of rows in df_rentals: 10260
Number of rows in df_merged: 12844

In [379]:
df_merged.head()

   RegionName       Date      HomeValue  RentalValue
0       11368 2018-01-31  475623.750409          NaN
1       11385 2018-01-31  689332.524200  2326.050511
2       11208 2018-01-31  476537.559613          NaN
3       11236 2018-01-31  471722.143605          NaN
4       10467 2018-01-31  407100.997435  1274.181284

### Checking percentage of Nan values

In [380]:
#what percentage of the rows with rental values are Nan
num_rows_rentalValue = df_merged['RentalValue'].shape[0]
num_rows_rentalValue_NaN = df_merged['RentalValue'].isnull().sum()
percentage_NaN = (num_rows_rentalValue_NaN/num_rows_rentalValue) * 100
print(f"Percentage of rows with rental values that are NaN: {percentage_NaN}")

Percentage of rows with rental values that are NaN: 44.90034257240735

In [381]:
#what percentage of the rows with home values are Nan
num_rows_homeValue = df_merged['HomeValue'].shape[0]
num_rows_homeValue_NaN = df_merged['HomeValue'].isnull().sum()
percentage_NaN = (num_rows_homeValue_NaN/num_rows_homeValue) * 100
print(f"Percentage of rows with home values that are NaN: {percentage_NaN}")

Percentage of rows with home values that are NaN: 1.175646216132046

### Changing Nan values to 0

In [384]:
#change all NaN values to 0
df_merged = df_merged.fillna(0)

### Renaming RegionName to ZipCode

In [382]:
#rename column RegionName to ZipCode
df_merged = df_merged.rename(columns={'RegionName': 'ZipCode'})

## Print to csv

In [383]:
#print to csv

df_merged.to_csv('Home_Rental_Value_Index.csv', index=False)